; domain
;credit: As defined in the book 'An Introduction to the Planning Domain Deﬁnition Language' (Patrik Haslum)
(define (domain knights-tour)
    (:requirements :negative-preconditions)    
    (:predicates
        (at ?col ?row)
        (visited ?col ?row)
        (diff_by_one ?x ?y)
        (diff_by_two ?x ?y)
    )
    ; Action move_2col_1row moves the Knight two steps along the horizontal
    ; axis (changing the column by 2) and one step along the vertical axis
    ; (changing the row by 1), while action move_2row_1col below does the
    ; opposite.
    (:action move_2col_1row
        :parameters (?from_col ?from_row ?to_col ?to_row)
        :precondition (and (at ?from_col ?from_row)
                           (diff_by_two ?from_col ?to_col) ; col +/- 2
                           (diff_by_one ?from_row ?to_row) ; row +/- 1
                           (not (visited ?to_col ?to_row)))
        :effect (and (not (at ?from_col ?from_row))
                     (at ?to_col ?to_row)
                     (visited ?to_col ?to_row))
    )
    (:action move_2row_1col
        :parameters (?from_col ?from_row ?to_col ?to_row)
        :precondition (and (at ?from_col ?from_row)
                           (diff_by_two ?from_row ?to_row) ; row +/- 2
                           (diff_by_one ?from_col ?to_col) ; col +/- 1
                           (not (visited ?to_col ?to_row)))
        :effect (and (not (at ?from_col ?from_row))
                     (at ?to_col ?to_row)
                     (visited ?to_col ?to_row))
    )
)

; problem
;credit: As defined in the book 'An Introduction to the Planning Domain Deﬁnition Language' (Patrik Haslum)
(define (problem knights-tour-problem-8x8)
    (:domain knights-tour)
    ; Define a set of "numbers" 1..8:
    (:objects n1 n2 n3 n4 n5 n6 n7 n8)
    (:init
        ; Initial position of the Knight piece (upper left corner):2.1. DOMAIN AND PROBLEM DEFINITION
        (at n1 n8)
        (visited n1 n8)
        ; Here, we have to list all instances of the static
        ; predicates diff_by_two and diff_by_one:
		;Difference by one:
		(diff_by_one n1 n2)
		(diff_by_one n2 n1)
		(diff_by_one n2 n3)
		(diff_by_one n3 n2)
		(diff_by_one n3 n4)
		(diff_by_one n4 n3)
		(diff_by_one n4 n5)
		(diff_by_one n5 n4)
		(diff_by_one n5 n6)
		(diff_by_one n6 n5)
		(diff_by_one n6 n7)
		(diff_by_one n7 n6)
		(diff_by_one n7 n8)
		(diff_by_one n8 n7)
		;Difference by two:
		(diff_by_two n1 n3)
		(diff_by_two n3 n1)
		(diff_by_two n2 n4)
		(diff_by_two n4 n2)
		(diff_by_two n3 n5)
		(diff_by_two n5 n3)
		(diff_by_two n4 n6)
		(diff_by_two n6 n4)
		(diff_by_two n5 n7)
		(diff_by_two n7 n5)
		(diff_by_two n6 n8)
		(diff_by_two n8 n6)
    )
    (:goal (and
				(visited n1 n1)
				(visited n1 n2)
				(visited n1 n3)
				(visited n1 n4)
				(visited n1 n5)
				(visited n1 n6)
				(visited n1 n7)
				(visited n1 n8)
				(visited n2 n1)
				(visited n2 n2)
				(visited n2 n3)
				(visited n2 n4)
				(visited n2 n5)
				(visited n2 n6)
				(visited n2 n7)
				(visited n2 n8)
				(visited n3 n1)
				(visited n3 n2)
				(visited n3 n3)
				(visited n3 n4)
				(visited n3 n5)
				(visited n3 n6)
				(visited n3 n7)
				(visited n3 n8)
				(visited n4 n1)
				(visited n4 n2)
				(visited n4 n3)
				(visited n4 n4)
				(visited n4 n5)
				(visited n4 n6)
				(visited n4 n7)
				(visited n4 n8)
				(visited n5 n1)
				(visited n5 n2)
				(visited n5 n3)
				(visited n5 n4)
				(visited n5 n5)
				(visited n5 n6)
				(visited n5 n7)
				(visited n5 n8)
				(visited n6 n1)
				(visited n6 n2)
				(visited n6 n3)
				(visited n6 n4)
				(visited n6 n5)
				(visited n6 n6)
				(visited n6 n7)
				(visited n6 n8)
				(visited n7 n1)
				(visited n7 n2)
				(visited n7 n3)
				(visited n7 n4)
				(visited n7 n5)
				(visited n7 n6)
				(visited n7 n7)
				(visited n7 n8)
				(visited n8 n1)
				(visited n8 n2)
				(visited n8 n3)
				(visited n8 n4)
				(visited n8 n5)
				(visited n8 n6)
				(visited n8 n7)
				(visited n8 n8)
           )
    )
)

; plan
1. (move_2col_1row n1 n8 n3 n7)
   deleted: (at n1 n8)
   added: (at n3 n7) (visited n3 n7)
   goals met: 2 of 64
2. (move_2row_1col n3 n7 n4 n5)
   deleted: (at n3 n7)
   added: (at n4 n5) (visited n4 n5)
   goals met: 3 of 64
3. (move_2row_1col n4 n5 n5 n3)
   deleted: (at n4 n5)
   added: (at n5 n3) (visited n5 n3)
   goals met: 4 of 64
4. (move_2row_1col n5 n3 n6 n5)
   deleted: (at n5 n3)
   added: (at n6 n5) (visited n6 n5)
   goals met: 5 of 64
5. (move_2col_1row n6 n5 n4 n4)
   deleted: (at n6 n5)
   added: (at n4 n4) (visited n4 n4)
   goals met: 6 of 64
6. (move_2col_1row n4 n4 n6 n3)
   deleted: (at n4 n4)
   added: (at n6 n3) (visited n6 n3)
   goals met: 7 of 64
7. (move_2col_1row n6 n3 n8 n4)
   deleted: (at n6 n3)
   added: (at n8 n4) (visited n8 n4)
   goals met: 8 of 64
8. (move_2row_1col n8 n4 n7 n2)
   deleted: (at n8 n4)
   added: (at n7 n2) (visited n7 n2)
   goals met: 9 of 64
9. (move_2col_1row n7 n2 n5 n1)
   deleted: (at n7 n2)
   added: (at n5 n1) (visited n5 n1)
   goals met: 10 of 64
10. (move_2col_1row n5 n1 n3 n2)
   deleted: (at n5 n1)
   added: (at n3 n2) (visited n3 n2)
   goals met: 11 of 64
11. (move_2col_1row n3 n2 n1 n1)
   deleted: (at n3 n2)
   added: (at n1 n1) (visited n1 n1)
   goals met: 12 of 64
12. (move_2row_1col n1 n1 n2 n3)
   deleted: (at n1 n1)
   added: (at n2 n3) (visited n2 n3)
   goals met: 13 of 64
13. (move_2col_1row n2 n3 n4 n2)
   deleted: (at n2 n3)
   added: (at n4 n2) (visited n4 n2)
   goals met: 14 of 64
14. (move_2col_1row n4 n2 n6 n1)
   deleted: (at n4 n2)
   added: (at n6 n1) (visited n6 n1)
   goals met: 15 of 64
15. (move_2col_1row n6 n1 n8 n2)
   deleted: (at n6 n1)
   added: (at n8 n2) (visited n8 n2)
   goals met: 16 of 64
16. (move_2row_1col n8 n2 n7 n4)
   deleted: (at n8 n2)
   added: (at n7 n4) (visited n7 n4)
   goals met: 17 of 64
17. (move_2row_1col n7 n4 n8 n6)
   deleted: (at n7 n4)
   added: (at n8 n6) (visited n8 n6)
   goals met: 18 of 64
18. (move_2row_1col n8 n6 n7 n8)
   deleted: (at n8 n6)
   added: (at n7 n8) (visited n7 n8)
   goals met: 19 of 64
19. (move_2col_1row n7 n8 n5 n7)
   deleted: (at n7 n8)
   added: (at n5 n7) (visited n5 n7)
   goals met: 20 of 64
20. (move_2col_1row n5 n7 n3 n8)
   deleted: (at n5 n7)
   added: (at n3 n8) (visited n3 n8)
   goals met: 21 of 64
21. (move_2row_1col n3 n8 n2 n6)
   deleted: (at n3 n8)
   added: (at n2 n6) (visited n2 n6)
   goals met: 22 of 64
22. (move_2row_1col n2 n6 n3 n4)
   deleted: (at n2 n6)
   added: (at n3 n4) (visited n3 n4)
   goals met: 23 of 64
23. (move_2row_1col n3 n4 n2 n2)
   deleted: (at n3 n4)
   added: (at n2 n2) (visited n2 n2)
   goals met: 24 of 64
24. (move_2row_1col n2 n2 n1 n4)
   deleted: (at n2 n2)
   added: (at n1 n4) (visited n1 n4)
   goals met: 25 of 64
25. (move_2col_1row n1 n4 n3 n5)
   deleted: (at n1 n4)
   added: (at n3 n5) (visited n3 n5)
   goals met: 26 of 64
26. (move_2col_1row n3 n5 n5 n4)
   deleted: (at n3 n5)
   added: (at n5 n4) (visited n5 n4)
   goals met: 27 of 64
27. (move_2col_1row n5 n4 n7 n5)
   deleted: (at n5 n4)
   added: (at n7 n5) (visited n7 n5)
   goals met: 28 of 64
28. (move_2row_1col n7 n5 n6 n7)
   deleted: (at n7 n5)
   added: (at n6 n7) (visited n6 n7)
   goals met: 29 of 64
29. (move_2col_1row n6 n7 n8 n8)
   deleted: (at n6 n7)
   added: (at n8 n8) (visited n8 n8)
   goals met: 30 of 64
30. (move_2row_1col n8 n8 n7 n6)
   deleted: (at n8 n8)
   added: (at n7 n6) (visited n7 n6)
   goals met: 31 of 64
31. (move_2col_1row n7 n6 n5 n5)
   deleted: (at n7 n6)
   added: (at n5 n5) (visited n5 n5)
   goals met: 32 of 64
32. (move_2row_1col n5 n5 n4 n3)
   deleted: (at n5 n5)
   added: (at n4 n3) (visited n4 n3)
   goals met: 33 of 64
33. (move_2row_1col n4 n3 n3 n1)
   deleted: (at n4 n3)
   added: (at n3 n1) (visited n3 n1)
   goals met: 34 of 64
34. (move_2col_1row n3 n1 n1 n2)
   deleted: (at n3 n1)
   added: (at n1 n2) (visited n1 n2)
   goals met: 35 of 64
35. (move_2row_1col n1 n2 n2 n4)
   deleted: (at n1 n2)
   added: (at n2 n4) (visited n2 n4)
   goals met: 36 of 64
36. (move_2row_1col n2 n4 n1 n6)
   deleted: (at n2 n4)
   added: (at n1 n6) (visited n1 n6)
   goals met: 37 of 64
37. (move_2row_1col n1 n6 n2 n8)
   deleted: (at n1 n6)
   added: (at n2 n8) (visited n2 n8)
   goals met: 38 of 64
38. (move_2col_1row n2 n8 n4 n7)
   deleted: (at n2 n8)
   added: (at n4 n7) (visited n4 n7)
   goals met: 39 of 64
39. (move_2col_1row n4 n7 n6 n8)
   deleted: (at n4 n7)
   added: (at n6 n8) (visited n6 n8)
   goals met: 40 of 64
40. (move_2col_1row n6 n8 n8 n7)
   deleted: (at n6 n8)
   added: (at n8 n7) (visited n8 n7)
   goals met: 41 of 64
41. (move_2col_1row n8 n7 n6 n6)
   deleted: (at n8 n7)
   added: (at n6 n6) (visited n6 n6)
   goals met: 42 of 64
42. (move_2col_1row n6 n6 n8 n5)
   deleted: (at n6 n6)
   added: (at n8 n5) (visited n8 n5)
   goals met: 43 of 64
43. (move_2row_1col n8 n5 n7 n7)
   deleted: (at n8 n5)
   added: (at n7 n7) (visited n7 n7)
   goals met: 44 of 64
44. (move_2col_1row n7 n7 n5 n8)
   deleted: (at n7 n7)
   added: (at n5 n8) (visited n5 n8)
   goals met: 45 of 64
45. (move_2row_1col n5 n8 n4 n6)
   deleted: (at n5 n8)
   added: (at n4 n6) (visited n4 n6)
   goals met: 46 of 64
46. (move_2col_1row n4 n6 n2 n5)
   deleted: (at n4 n6)
   added: (at n2 n5) (visited n2 n5)
   goals met: 47 of 64
47. (move_2row_1col n2 n5 n1 n3)
   deleted: (at n2 n5)
   added: (at n1 n3) (visited n1 n3)
   goals met: 48 of 64
48. (move_2row_1col n1 n3 n2 n1)
   deleted: (at n1 n3)
   added: (at n2 n1) (visited n2 n1)
   goals met: 49 of 64
49. (move_2row_1col n2 n1 n3 n3)
   deleted: (at n2 n1)
   added: (at n3 n3) (visited n3 n3)
   goals met: 50 of 64
50. (move_2row_1col n3 n3 n4 n1)
   deleted: (at n3 n3)
   added: (at n4 n1) (visited n4 n1)
   goals met: 51 of 64
51. (move_2col_1row n4 n1 n6 n2)
   deleted: (at n4 n1)
   added: (at n6 n2) (visited n6 n2)
   goals met: 52 of 64
52. (move_2col_1row n6 n2 n8 n1)
   deleted: (at n6 n2)
   added: (at n8 n1) (visited n8 n1)
   goals met: 53 of 64
53. (move_2row_1col n8 n1 n7 n3)
   deleted: (at n8 n1)
   added: (at n7 n3) (visited n7 n3)
   goals met: 54 of 64
54. (move_2col_1row n7 n3 n5 n2)
   deleted: (at n7 n3)
   added: (at n5 n2) (visited n5 n2)
   goals met: 55 of 64
55. (move_2col_1row n5 n2 n7 n1)
   deleted: (at n5 n2)
   added: (at n7 n1) (visited n7 n1)
   goals met: 56 of 64
56. (move_2row_1col n7 n1 n8 n3)
   deleted: (at n7 n1)
   added: (at n8 n3) (visited n8 n3)
   goals met: 57 of 64
57. (move_2col_1row n8 n3 n6 n4)
   deleted: (at n8 n3)
   added: (at n6 n4) (visited n6 n4)
   goals met: 58 of 64
58. (move_2row_1col n6 n4 n5 n6)
   deleted: (at n6 n4)
   added: (at n5 n6) (visited n5 n6)
   goals met: 59 of 64
59. (move_2row_1col n5 n6 n4 n8)
   deleted: (at n5 n6)
   added: (at n4 n8) (visited n4 n8)
   goals met: 60 of 64
60. (move_2col_1row n4 n8 n2 n7)
   deleted: (at n4 n8)
   added: (at n2 n7) (visited n2 n7)
   goals met: 61 of 64
61. (move_2row_1col n2 n7 n1 n5)
   deleted: (at n2 n7)
   added: (at n1 n5) (visited n1 n5)
   goals met: 62 of 64
62. (move_2col_1row n1 n5 n3 n6)
   deleted: (at n1 n5)
   added: (at n3 n6) (visited n3 n6)
   goals met: 63 of 64
63. (move_2col_1row n3 n6 n1 n7)
   deleted: (at n3 n6)
   added: (at n1 n7) (visited n1 n7)
   goals met: 64 of 64
